trade_exp/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Наш</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a9733f12-e26b-44d6-8c73-49b629ab1280">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ИзмененияШтрихкодов/ИзмененияШтрихкодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="46b95a22-f500-491e-a509-885b652b2970">
  <name>ИзмененияШтрихкодов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes extendedConfigurationObject="e562f2ef-adb9-43d8-961c-e9b274694ce4">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea730551-69af-4a37-a9ab-3bd8d4caff62">
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="73fa3d2b-30c5-4c8a-9568-6a2fa216a84c">
    <name>Изменение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="39a92863-8a09-4b46-9163-e7d96000f078">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a428d6e9-745e-4ef3-b6ca-9da2202481a8">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="086a7474-2bf9-413d-9e5d-01372d2175f4">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="02b45e70-c3e7-4a54-a5d1-e4261adeabe5">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="880a458c-11c2-42d4-b2bc-4b0a3f1413e5">
    <name>Штрихкод2</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ШтрихкодыНоменклатуры/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, Замещение)
        
    УстановитьПривилегированныйРежим(Истина);
    
    ТекДата = ТекущаяДата();
        
    Если ЭтотОбъект.Количество() = 0 Тогда
        Набор = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
        Набор.Отбор.Штрихкод.Установить(ЭтотОбъект.Отбор.Штрихкод.Значение);
        Набор.Прочитать();
        Для Каждого Запись Из Набор Цикл
            ЗафиксироватьИзменение(Запись, ТекДата, "Удалено");
        КонецЦикла;    
    КонецЕсли;
    
    УстановитьПривилегированныйРежим(Ложь);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.Ответственный=Пользователи.ТекущийПользователь();
	КонецЦикла;
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ, Замещение)
    
    УстановитьПривилегированныйРежим(Истина);
    
    ТекДата = ТекущаяДата();
    
    Для Каждого Запись Из ЭтотОбъект Цикл
        Набор = РегистрыСведений.ИзмененияШтрихкодов.СоздатьНаборЗаписей();
        Набор.Отбор.Номенклатура.Установить(Запись.Номенклатура);
        Набор.Отбор.Характеристика.Установить(Запись.Характеристика);
        Набор.Отбор.Упаковка.Установить(Запись.Упаковка);
        Набор.Прочитать();
        Для Каждого Эл Из Набор Цикл
            Если Эл.Пользователь = Пользователи.ТекущийПользователь() И Эл.Операция = "Удалено" И Эл.Период >= ТекДата - 15 Тогда
                 Эл.Штрихкод2 = Запись.Штрихкод;
                 Эл.Операция = "Изменено";
                 Набор.Записать();
             Иначе
                
                ЗафиксироватьИзменение(Запись, ТекДата, "Добавлено");
            КонецЕсли;
        КонецЦикла;
    МаркировкаАльтерра.ЗаписатьGTINИС(Запись);
    КонецЦикла;
    
    УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры


Процедура ЗафиксироватьИзменение(Запись, ТекДата, Операция)
    МенеджерЗаписи = РегистрыСведений.ИзмененияШтрихкодов.СоздатьМенеджерЗаписи();
    ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись);
    МенеджерЗаписи.Период = ТекДата;
    МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
    МенеджерЗаписи.Операция = Операция;
    Если Операция = "Добавлено" Тогда
        МенеджерЗаписи.Штрихкод = Null;
        МенеджерЗаписи.Штрихкод2 = Запись.Штрихкод;
    Иначе
        Штрихкод2 = Null;
    КонецЕсли;
    МенеджерЗаписи.Изменение = Истина;
    МенеджерЗаписи.Записать();    
КонецПроцедуры


#КонецОбласти

#КонецЕсли
